## SQLite Interfaces

1. Connecting to the database
2. Viewing the list of tables
3. Selecting all data from the `offices` table
4. Viewing the column names for the `offices` table
5. Disconnecting from the database

## Connecting to a Database Using `sqlite3` + `pandas`

**Connecting to the database**

In [2]:
import pandas as pd
import sqlite3

conn = sqlite3.connect('data.sqlite')

**Viewing the List of Tables**

In [3]:
df = pd.read_sql("""
    SELECT *
    FROM sqlite_master 
    WHERE type = 'table';
    """,conn)
df

,type,name,tbl_name,rootpage,sql
0,table,orderdetails,orderdetails,2,"CREATE TABLE `orderdetails` (`orderNumber`, `p..."
1,table,payments,payments,28,"CREATE TABLE `payments` (`customerNumber`, `ch..."
2,table,offices,offices,32,"CREATE TABLE `offices` (`officeCode`, `city`, ..."
3,table,customers,customers,33,"CREATE TABLE `customers` (`customerNumber`, `c..."
4,table,orders,orders,38,"CREATE TABLE `orders` (`orderNumber`, `orderDa..."
5,table,productlines,productlines,46,"CREATE TABLE `productlines` (`productLine`, `t..."
6,table,products,products,47,"CREATE TABLE `products` (`productCode`, `produ..."
7,table,employees,employees,56,"CREATE TABLE `employees` (`employeeNumber`, `l..."

In [4]:
df = pd.read_sql("""
    SELECT name 
    FROM sqlite_master 
    WHERE type = 'table';
    """,conn)
df

           name
0  orderdetails
1      payments
2       offices
3     customers
4        orders
5  productlines
6      products
7     employees

In [5]:
type(df)

pandas.core.frame.DataFrame

**Selecting all Data from the `office` Table and viewing nthe column names from the `office` Table**

In [9]:
pd.read_sql("""
            SELECT *
            FROM offices;
""", conn)

,officeCode,city,phone,addressLine1,addressLine2,state,country,postalCode,territory
0,1,San Francisco,+1 650 219 4782,100 Market Street,Suite 300,CA,USA,94080,NA
1,2,Boston,+1 215 837 0825,1550 Court Place,Suite 102,MA,USA,02107,NA
2,3,NYC,+1 212 555 3000,523 East 53rd Street,apt. 5A,NY,USA,10022,NA
3,4,Paris,+33 14 723 4404,43 Rue Jouffroy D'abbans,,,France,75017,EMEA
4,5,Tokyo,+81 33 224 5000,4-1 Kioicho,,Chiyoda-Ku,Japan,102-8578,Japan
5,6,Sydney,+61 2 9264 2451,5-11 Wentworth Avenue,Floor #2,,Australia,NSW 2010,APAC
6,7,London,+44 20 7877 2041,25 Old Broad Street,Level 7,,UK,EC2N 1HN,EMEA

**Disconnecting from the Database**

In [ ]:
conn.close()